/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tarthas <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/03/16 10:17:42 by tarthas           #+#    #+#             */
/*   Updated: 2020/03/16 19:38:21 by tarthas          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_bsq.h"

int main(int argc, char **argv)
{
	int **tmp;
	char **s;

	//Проверка argc, вычисляется col_number, проверка что все строки длинной col_num
	//Считывание map в матрицу s. В итоге char **s.
	//Считывание параметров map, в итоге obst = символ препятсвия, fill = символ заполнения.
	

	//while (argc - i_arg > 0)//Здесь подставлем по очереди все map
	//{
	s = (char**)malloc(sizeof(char*) * 10);
	int i;
	i=0;
	while (i < 10)
	{
		s[i] = (char*)malloc(sizeof(char) * 28);
		i++;
	}
	s[0] = "...........................\0";
	s[1] = "....o......................\0";
	s[2] = "............o..............\0";
	s[3] = "...........................\0";
	s[4] = "....o......................\0";
	s[5] = "...............o...........\0";
	s[6] = "...........................\0";
	s[7] = "......o..............o.....\0";
	s[8] = "..o.......o................\0";
	s[9] = 0;

	int row_num = 10;
	int col_num = 28;
	char obst = 'o';
	char fill = 'x';

	t_type res;
	res.x = 2;
	res.y = 22;
	res.max = 3;
	res = ft_find(s, row_num, col_num, obst);
	ft_fill(s, res, fill);
	//**s = 'o';
	//ft_print(s);
	//}
return (0);
}
